// Number
// เลขใน Javascript มีแค่ type เดียวก็คือ number
// ชื่อเต็มๆ ของมันคือ 64 bit floating point ตามมาตรฐาน IEEE 754

// IEEE 754
// มันมี 64 bits ก็จริง แต่มันถูกแบ่งออกเป็น 3 group
// เวลานับ bit ให้นับจากขวามาซ้าย
// 52 bits (0-51) เป็น เลข
// 11 bits (52-62) เป็น เลขยกกำลัง
// 1 bits (63) เป็น เครื่องหมาย บวก ลบ

typeof 1

// นอกจากจำนวนเต็มแล้ว ยังเป็น ทศนิยมได้ด้วย

typeof 1.1;

// เป็นเลขก็ +, -, * , / ได้ปกติ เหมือนในภาษาอื่น

1+2 // 3
1-2 // -1
1*2 // 2
1/2 // 0.5

// แต่ความแปลกประหลาดของมันมีเล็กน้อยคือ

999999999999999  // 999999999999999
9999999999999999 // 10000000000000000

// และ

0.1+0.2 == 0.3 // false
0.1+0.2 // 0.30000000000000004

// *ประเด็น คือ อย่าเอา Pure Javascript ไปทำงานที่ต้องการความแม่นยำสูง

// เลขสามารถเขียนได้อีกแบบ

1e10 // 10000000000
1e-6 // 0.000001

// เขียนเป็น hex, binary, octal ก็ได้

0xff       // 255
0b11111111 // 255
0o377      // 255

// special number มี 3 ค่า

Infinity
-Infinity
NaN // not a number คือเวลาทำ arithemetic แล้วไม่สามารถได้ตัวเลขมันจะได้ NaN แทน
// แต่
console.log(typeof NaN) // เป็น number นะ

